In [139]:
import pandas as pd
import numpy as np

In [142]:
# make some random dataframe
df = pd.DataFrame()

In [143]:
# make a goofy dataframe
df['A'] = [10, 2, 8, 6, 9, 4]
df['B'] = 1
df['C'] = 3
df['state'] = ['IL', 'IN', 'MA', 'MA', 'IN', 'IL']
df

    A  B  C state
0  10  1  3    IL
1   2  1  3    IN
2   8  1  3    MA
3   6  1  3    MA
4   9  1  3    IN
5   4  1  3    IL

In [114]:
# now below we'll make another dataframe

In [144]:
normalizer = pd.DataFrame([4, 5, 6], ['IL', 'IN', 'MA'])

In [145]:
normalizer

    0
IL  4
IN  5
MA  6

In [146]:
# index into our normalizer df
normalizer[0]['IL']

4

In [147]:
df

    A  B  C state
0  10  1  3    IL
1   2  1  3    IN
2   8  1  3    MA
3   6  1  3    MA
4   9  1  3    IN
5   4  1  3    IL

In [148]:
df['normalized'] = 0
newlist = []
for index, row in df.iterrows():
    newlist.append( row['A'] / normalizer[0][row['state']] )
df['normalized'] = newlist

In [149]:
df

    A  B  C state  normalized
0  10  1  3    IL    2.500000
1   2  1  3    IN    0.400000
2   8  1  3    MA    1.333333
3   6  1  3    MA    1.000000
4   9  1  3    IN    1.800000
5   4  1  3    IL    1.000000